/*
+FHDR------------------------------------------------------------------
Copyright (c),
Tony Yang –specialized in fat usb firmware development  
Contact:qq 292942278  e-mail:tony_yang123@sina.com.cn
;;;;;;;;;;
Abstract:
Abstract:
Sector Read/Write Driver
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
$Id: flash_management.c,v 1.1.1.1 2007/02/26 14:01:12 Design Exp $
-FHDR-------------------------------------------------------------------
*/
/*
===============================================================================
函数
Read flash sector(512bytes)
入口：u8 *buf:缓冲区首地址,u32 sector:物理扇区号
出口：SUCC
===============================================================================
*/
extern u8 read_flash_sector(u8 *buf,u32 sector, u8 disk_id);
/*
===============================================================================
函数
Write flash sector(512bytes)
入口：u8 *buf:缓冲区首地址,u32 sector:物理扇区号
出口：SUCC
===============================================================================
*/
extern u8 write_flash_sector(u8 *buf,u32 sector, u8 disk_id);  

/*
===============================================================================
函数
打开模拟磁盘IMG文件fat16.img
入口：无
出口：无
===============================================================================
*/
extern u8 flash_management_sysinit();
/*
+FFTR--------------------------------------------------------------------
$Log: flash_management.h,v $

-FFTR--------------------------------------------------------------------
*/