/*********************************************************************************************************
* 文件名：UART.C
* 功能：  向串口发送数据。
* 说明：  使用外部11.0592MHz晶振，根据CONFIG.H文件配置，Fpclk=11.0592MHz；
*         通讯波特率115200，8位数据位，1位停止位，无奇偶校验。
*********************************************************************************************************/
#include "..\config.h"

#define   BAUD                      115200
/*********************************************************************************************************
** 名称 ： uart0Init
** 功能 ： 串口初始化
** 入口 ： 无
** 出口 ： 无
*********************************************************************************************************/
void uart0Init (void)
{
    unsigned int  temp;


    temp  = (FPCLK / BAUD) >> 4 ;

    PCONP |= 1 << 3;

    U0LCR = 0x83;		                                                /* DLAB = 1，可设置波特率       */
    U0DLM = (unsigned char)(temp >> 8);
    U0DLL = (unsigned char)(temp);
    U0FDR = 0x10;
    U0LCR = 0x03;                                                       /*  8位数据                     */
}

/*********************************************************************************************************
* 名称：uart0ByteSend
* 功能：向串口发送字节数据，并等待发送完毕。
* 入口：data		要发送的数据
* 出口：无
*********************************************************************************************************/
void  uart0ByteSend (unsigned char ucData)
{
    while ((U0LSR & 0x40) == 0);	                                    /* 等待数据发送完毕             */
    U0THR = ucData;				                                        /* 发送数据                     */
}


/*********************************************************************************************************
* 名称：uart0StrSend
* 功能：向串口发送一字符串
* 入口：srt		要发送的字符串的指针
* 出口：无
*********************************************************************************************************/
void  uart0StrSend (char *str)
{
    OS_ENTER_CRITICAL();
    while(*str != '\0')
    {
        uart0ByteSend(*str++);	                                        /* 发送数据                     */
    }
    OS_EXIT_CRITICAL();
}


